УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НеОтгружатьЧастями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПотреблениеДляДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КатегорияЭксплуатации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Назначения/Назначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Назначения</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДвиженияПоСкладскимРегистрам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьТолькоНаличие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84450f4c-12f4-48e1-92d7-52e1fec0d1f1">
    <name>смартМенеджерСайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58a4348b-43e7-46fb-966f-fdf2e9858abd">
    <name>смартРабочаяПочта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9984e2d4-a5d7-4891-bd52-251aae7eea37">
    <name>смартРабочийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаказНаВнутреннееПотребление/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеренесеноСДоработами 
//++ #1263 смарт: Фролов 01.12.2022 //Служебная записка на списание ПФ (Заказ на внутреннее потребление)  
&Вместо ("ДобавитьКомандыПечати")
Процедура смарт_ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//++ #3918 смарт: Тимофеева 21.08.2025 / Создать ПФ Служебной записки на списание Каталогов 
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "смартСлужебнаяЗаписка";
	//КомандаПечати.Представление = НСтр("ru = 'Служебная записка'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "смартСлужебнаяЗапискаНаРемонтныеРаботы";
	КомандаПечати.Представление = НСтр("ru = 'Служебная записка на ремонтные работы'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 

 	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "смартСлужебнаяЗапискаНаСписаниеКаталогов";
	КомандаПечати.Представление = НСтр("ru = 'Служебная записка на списание каталогов'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//-- #3918 смарт: Тимофеева 21.08.2025
	
КонецПроцедуры
//-- #1263 смарт: Фролов 01.12.2022

&ИзменениеИКонтроль("ОписаниеФормыДокументаДляЗаполненияРеквизитовСвязанныхСНаправлениемДеятельности")
Функция смарт_ОписаниеФормыДокументаДляЗаполненияРеквизитовСвязанныхСНаправлениемДеятельности()

	СтруктураОбъекта = НаправленияДеятельностиСервер.СтруктураОбъекта();
	СтруктураОбъекта.ЭтоИсточникПотребности = Истина;
	СтруктураОбъекта.ЕстьНазначениеВТЧ = Ложь;
	
	#Вставка
	//++ #Б4636 смарт: Шляпников 14.10.2025 / Заказ на внутреннее потребление. Доработка. Возможность указания Назначения.
	СтруктураОбъекта.ЕстьНазначениеВТЧ = Истина;
	//-- #Б4636 смарт: Шляпников 14.10.2025
	#КонецВставки
	
	Возврат СтруктураОбъекта;

КонецФункции

&ИзменениеИКонтроль("ВременныеТаблицыДокументаДляРасчетаСостояний")
Функция смарт_ВременныеТаблицыДокументаДляРасчетаСостояний()

	ТекстЗапросаТовары =
		"ВЫБРАТЬ
		|	Таблица.Ссылка                  КАК Ссылка,
		|	Таблица.ДатаОтгрузки            КАК ДатаОтгрузки,
		|	Таблица.ВариантОбеспечения      КАК ВариантОбеспечения,
		|	Таблица.Ссылка.Склад            КАК Склад,
		|	Таблица.Номенклатура            КАК Номенклатура,
		|	Таблица.Характеристика          КАК Характеристика,
		|
		#Удаление
		|	Таблица.Ссылка.Назначение       КАК Назначение,
		#КонецУдаления
		#Вставка
		//++ #Б4636 смарт: Шляпников 14.10.2025 / Заказ на внутреннее потребление. Доработка. Возможность указания Назначения.
		|	ВЫБОР КОГДА Таблица.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА Таблица.Ссылка.Назначение ИНАЧЕ Таблица.Назначение КОНЕЦ КАК Назначение,
		//-- #Б4636 смарт: Шляпников 14.10.2025
		#КонецВставки
		|	
		|	ИСТИНА                          КАК ЭтоТовар,
		|	Таблица.Количество              КАК Количество
		|	
		|ПОМЕСТИТЬ ВтТоварыДокумента
		|ИЗ
		|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка В(&МассивЗаказов)
		|	И НЕ Таблица.Отменено";
	
	ТекстЗапросаРеквизиты =
		"ВЫБРАТЬ
		|	Таблица.Ссылка            КАК Ссылка,
		|	Таблица.Проведен          КАК Проведен,
		|	
		|	ВЫБОР КОГДА Таблица.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КОбеспечению) ТОГДА
		|				ЛОЖЬ
		|			ИНАЧЕ
		|				ИСТИНА
		|		КОНЕЦ                 КАК СтатусКОтгрузке,
		|	
		|	ВЫБОР КОГДА Таблица.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.Закрыт) ТОГДА
		|				ИСТИНА
		|			ИНАЧЕ
		|				ЛОЖЬ
		|		КОНЕЦ                 КАК СтатусЗакрыт
		|	
		|ПОМЕСТИТЬ ВтРеквизитыДокумента
		|ИЗ
		|	Документ.ЗаказНаВнутреннееПотребление КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка В(&МассивЗаказов)";
	
	Результат = Новый Структура("ТоварыДокумента, РеквизитыДокумента", ТекстЗапросаТовары, ТекстЗапросаРеквизиты);
	Возврат Результат;
	
КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаЗаказовКОбеспечению")
Функция смарт_ТекстЗапросаЗаказовКОбеспечению()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Т.Ссылка                        КАК Заказ,
	|	Т.КодСтроки                     КАК КодСтроки,
	|	Т.НомерСтроки                   КАК НомерСтроки,
	|	0                               КАК НомерСтрокиПродукция,
	|	НЕОПРЕДЕЛЕНО                    КАК Продукция,
	|	НЕОПРЕДЕЛЕНО                    КАК Этап,
	|	0                               КАК ЭтапПорядок,
	|	
	|	Т.Номенклатура                  КАК Номенклатура,
	|	Т.Характеристика                КАК Характеристика,
	|	ТаблицаДокумента.Склад          КАК Склад,
	|	
	#Удаление
	|	ТаблицаДокумента.Назначение     КАК Назначение,
	#КонецУдаления
	#Вставка
	//++ #Б4636 смарт: Шляпников 14.10.2025 / Заказ на внутреннее потребление. Доработка. Возможность указания Назначения.
	|	ВЫБОР КОГДА Т.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА ТаблицаДокумента.Назначение ИНАЧЕ Т.Назначение КОНЕЦ КАК Назначение,
	//-- #Б4636 смарт: Шляпников 14.10.2025
	#КонецВставки
	|	
	|	ТаблицаДокумента.Подразделение  КАК Подразделение,
	|	
	|	Т.ВариантОбеспечения            КАК ВариантОбеспечения,
	|	Т.ДатаОтгрузки                  КАК ДатаОтгрузки,
	|	Т.Упаковка                      КАК Упаковка,
	|	
	|	Т.Количество                    КАК Количество,
	|	
	|	ТаблицаДокумента.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
	|	ТаблицаДокумента.НеОтгружатьЧастями   КАК НеОтгружатьЧастями,
	|	ТаблицаДокумента.Дата                 КАК Дата,
	|	НЕОПРЕДЕЛЕНО                          КАК Партнер,
	|	ТаблицаДокумента.Ответственный        КАК Менеджер,
	|	ТаблицаДокумента.Статус               КАК Статус,
	|	&ИспользоватьСтатусыЗаказовНаВнутреннееПотребление КАК СтатусИспользуется
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление КАК ТаблицаДокумента
	|		ПО Т.Ссылка = ТаблицаДокумента.Ссылка
	|
	|ГДЕ
	|	Т.Ссылка В (&Заказы)
	|	И ТаблицаДокумента.Проведен
	|	И Т.Отменено = ЛОЖЬ
	|	И ТаблицаДокумента.ПометкаУдаления = ЛОЖЬ
	|	И Т.ВариантОбеспечения В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ИзЗаказов)
	|	)";

	Возврат ТекстЗапроса;

КонецФункции

&ИзменениеИКонтроль("ЗаполнитьВариантОбеспечения")
Функция смарт_ЗаполнитьВариантОбеспечения(Объект, Форма, Операция, ДанныеЗаполнения, ПараметрыУказанияСерий)

	#Вставка
	//++#1547 смарт: Лопато 22.03.2024 //Автоматическое заполнение серий чернил в заказах
	ЗаполнитьДатыОтгрузки = Ложь;
	ДатаПоУмолчанию = Макс(НачалоДня(ТекущаяДатаСеанса()), Объект.ЖелаемаяДатаОтгрузки);

	ПараметрыОбновленияДатыОтгрузки = ОбеспечениеСервер.ПараметрыОбновленияДатыОтгрузкиВДокументе();
	ПараметрыОбновленияДатыОтгрузки.ОтгружатьОднойДатой    = Объект.НеОтгружатьЧастями;
	ПараметрыОбновленияДатыОтгрузки.ЖелаемаяДатаОтгрузки   = Объект.ЖелаемаяДатаОтгрузки;
	ПараметрыОбновленияДатыОтгрузки.ДатаОтгрузкиВДокументе = Объект.ДатаОтгрузки;
	
	ОбеспечениеСервер.СдвинутьДатыИСвернутьДублиСтрок(ДанныеЗаполнения, Операция, ПараметрыОбновленияДатыОтгрузки);
	
	Для Каждого СтрокаОбеспечения Из ДанныеЗаполнения Цикл

		Идентификатор = СтрокаОбеспечения.Идентификатор;
		Если Операция = "СтрокаТовары" Или Операция = "СтрокиТовары" Или Операция = "Заказ" Тогда
			СтрокаТовары = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
		ИначеЕсли Операция = "ИндексыСтрок" Тогда
			СтрокаТовары = Объект.Товары[Идентификатор];
		КонецЕсли;

		Если Объект.НеОтгружатьЧастями Тогда
			ДатаПоУмолчанию = Макс(СтрокаОбеспечения.ДатаОтгрузки, ДатаПоУмолчанию);
			Если Операция = "Заказ" Или Операция = "ИндексыСтрок"
				Или ДатаПоУмолчанию > Объект.ДатаОтгрузки И СтрокаОбеспечения.Отгружено = 0  Тогда
				Объект.ДатаОтгрузки = ДатаПоУмолчанию;
				ЗаполнитьДатыОтгрузки = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;

	Если ЗаполнитьДатыОтгрузки Тогда
		ОбеспечениеСервер.ЗаполнитьРеквизитВКоллекции(Объект.Товары, "ДатаОтгрузки", Объект.ДатаОтгрузки);
	КонецЕсли;
	
	ДанныеЗаполнения = смартОбщегоНазначения.смартЗаполнитьОбеспечениеСериямиПоFEFO(Объект, Форма, Операция, ДанныеЗаполнения, ПараметрыУказанияСерий);
	//--#1547 смарт: Лопато 22.03.2024
	#КонецВставки
	
	ЭтоВыборОбеспеченияСУчетомСерий = Операция = "СтрокаТовары"
		И ПолучитьФункциональнуюОпцию("ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения");
	
	СтруктураДействий = Новый Структура;
	Если Форма <> Неопределено Тогда
		СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
			Новый Структура("ЕстьРаботы, ЕстьОтменено", Ложь, Истина));
	КонецЕсли;
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.СтруктураПересчетаСуммы("КоличествоУпаковок");

	ДатаПоУмолчанию = Макс(НачалоДня(ТекущаяДатаСеанса()), Объект.ЖелаемаяДатаОтгрузки);

	ЗаполнитьДатыОтгрузки = Ложь;
	ТекСтрокаТовары = Неопределено;
	Идентификатор   = Неопределено;
	СтарыеЗначения = ОбеспечениеКлиентСервер.КлючОбеспечения();
	НовыеЗначения  = ОбеспечениеКлиентСервер.КлючОбеспечения();
	Счетчик = 0;
	Добавлено = 0;
	
	ПараметрыОбновленияДатыОтгрузки = ОбеспечениеСервер.ПараметрыОбновленияДатыОтгрузкиВДокументе();
	ПараметрыОбновленияДатыОтгрузки.ОтгружатьОднойДатой    = Объект.НеОтгружатьЧастями;
	ПараметрыОбновленияДатыОтгрузки.ЖелаемаяДатаОтгрузки   = Объект.ЖелаемаяДатаОтгрузки;
	ПараметрыОбновленияДатыОтгрузки.ДатаОтгрузкиВДокументе = Объект.ДатаОтгрузки;
	
	ОбеспечениеСервер.СдвинутьДатыИСвернутьДублиСтрок(ДанныеЗаполнения, Операция, ПараметрыОбновленияДатыОтгрузки);
	
	Для Каждого СтрокаОбеспечения Из ДанныеЗаполнения Цикл

		// Выбор существующей, либо добавление новой строки.
		Если Идентификатор <> СтрокаОбеспечения.Идентификатор Тогда

			Идентификатор = СтрокаОбеспечения.Идентификатор;
			Если Операция = "СтрокаТовары" Или Операция = "СтрокиТовары" Или Операция = "Заказ" Тогда
				СтрокаТовары = Объект.Товары.НайтиПоИдентификатору(Идентификатор);
			ИначеЕсли Операция = "ИндексыСтрок" Тогда
				СтрокаТовары = Объект.Товары[Идентификатор + Добавлено];
			КонецЕсли;
			ТекСтрокаТовары = СтрокаТовары;
			ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммы(СтруктураПересчетаСуммы);
			ОбработкаТабличнойЧастиКлиентСервер.ЗаполнитьСтруктуруПересчетаСуммы(СтруктураПересчетаСуммы, ТекСтрокаТовары);

		Иначе
			ТекСтрокаТовары = Объект.Товары.Вставить(Объект.Товары.Индекс(ТекСтрокаТовары) + 1);
			ЗаполнитьЗначенияСвойств(ТекСтрокаТовары, СтрокаТовары);
			ТекСтрокаТовары.КодСтроки = 0;
			Добавлено = Добавлено + 1;
		КонецЕсли;
		
		// Заполнение полей обеспечения.
		ЗаполнитьЗначенияСвойств(СтарыеЗначения, ТекСтрокаТовары);

		ЗаполнитьЗначенияСвойств(ТекСтрокаТовары, СтрокаОбеспечения, "Количество, ВариантОбеспечения, ДатаОтгрузки");
		
		#Удаление
		Если ЭтоВыборОбеспеченияСУчетомСерий Тогда
	    #КонецУдаления
		
		#Вставка
		//++#1547 смарт: Лопато 22.03.2024 //Автоматическое заполнение серий чернил в заказах
		//++#1815 смарт: Лопато 13.05.2024 //Проблема со сбросом серийных номеров при изменении обеспечения  
		Если ТекСтрокаТовары.СтатусУказанияСерий <> 0
			И НЕ (Форма = Неопределено И Операция = "ИндексыСтрок")
			И смартОбщегоНазначения.смартДействуетОсобыйУчетСерий(ТекСтрокаТовары.Номенклатура) Тогда
		//--#1815 смарт: Лопато 13.05.2024
		//--#1547 смарт: Лопато 22.03.2024
	    #КонецВставки
		
			ТекСтрокаТовары.Серия = СтрокаОбеспечения.Серия;
		КонецЕсли;
		
		#Удаление
		Если Объект.НеОтгружатьЧастями Тогда
			ДатаПоУмолчанию = Макс(СтрокаОбеспечения.ДатаОтгрузки, ДатаПоУмолчанию);
			Если Операция = "Заказ" Или Операция = "ИндексыСтрок"
				Или ДатаПоУмолчанию > Объект.ДатаОтгрузки И СтрокаОбеспечения.Отгружено = 0  Тогда
				Объект.ДатаОтгрузки = ДатаПоУмолчанию;
				ЗаполнитьДатыОтгрузки = Истина;
			КонецЕсли;
		КонецЕсли;
	    #КонецУдаления
		
		ЗаполнитьЗначенияСвойств(НовыеЗначения, ТекСтрокаТовары);
		ОбеспечениеКлиентСервер.СчетИзменений(Счетчик, СтарыеЗначения, НовыеЗначения);

		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекСтрокаТовары, СтруктураДействий, КэшированныеЗначения);
		ОбработкаТабличнойЧастиКлиентСервер.ДобавитьСтрокуДляПересчетаСуммы(СтруктураПересчетаСуммы, ТекСтрокаТовары);

	КонецЦикла;

	ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммы(СтруктураПересчетаСуммы);
	
	Если ЗаполнитьДатыОтгрузки Тогда
		ОбеспечениеСервер.ЗаполнитьРеквизитВКоллекции(Объект.Товары, "ДатаОтгрузки", Объект.ДатаОтгрузки);
	КонецЕсли;

	Если ПараметрыУказанияСерий = Неопределено Тогда
		ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.ЗаказНаВнутреннееПотребление));
	КонецЕсли;
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);

	Если Операция = "СтрокаТовары" Или Операция = "СтрокиТовары" Или Операция = "Заказ" Тогда
		Форма.Модифицированность = Истина;
	КонецЕсли;

	Возврат ОбеспечениеКлиентСервер.ТекстОбработаноСтрок(Счетчик);
	
КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаТаблицаГрафикОтгрузкиТоваров")
Функция смарт_ТекстЗапросаТаблицаГрафикОтгрузкиТоваров(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ГрафикОтгрузкиТоваров";

	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаТовары.ДатаОтгрузки           КАК Период,
	|	ТаблицаТовары.ДатаОтгрузки           КАК ДатаОтгрузки,
	|
	|	ТаблицаТовары.Номенклатура           КАК Номенклатура,
	|	ТаблицаТовары.Характеристика         КАК Характеристика,
	|	&Склад                               КАК Склад,
	|
	#Удаление
	|	ВЫБОР КОГДА ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно) ТОГДА
	|			&Назначение
	|		КОНЕЦ                                            КАК Назначение,
	#КонецУдаления
	#Вставка
	//++ #Б4636 смарт: Шляпников 14.10.2025 / Заказ на внутреннее потребление. Доработка. Возможность указания Назначения.
	|	ВЫБОР КОГДА ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно) ТОГДА
	|		ВЫБОР КОГДА ТаблицаТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА &Назначение ИНАЧЕ ТаблицаТовары.Назначение КОНЕЦ 
	|	КОНЕЦ КАК Назначение,
	//-- #Б4636 смарт: Шляпников 14.10.2025
	#КонецВставки
	|
	|	ВЫБОР КОГДА ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ИзЗаказов) ТОГДА
	|			ТаблицаТовары.Количество
	|		КОНЕЦ                                            КАК КоличествоИзЗаказов,
	|
	|	ВЫБОР КОГДА ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно) ТОГДА
	|				ТаблицаТовары.Количество
	|		КОНЕЦ                                            КАК КоличествоПодЗаказ,
	|
	|	ВЫБОР КОГДА ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется) ТОГДА
	|			ТаблицаТовары.Количество
	|		КОНЕЦ                                            КАК КоличествоНеобеспечено
	|
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И НЕ ТаблицаТовары.Отменено
	|
	|	И ТаблицаТовары.ВариантОбеспечения В(
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ИзЗаказов),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно))";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаТаблицаОбеспечениеЗаказов")
Функция смарт_ТекстЗапросаТаблицаОбеспечениеЗаказов(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ОбеспечениеЗаказов";

	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ТекстЗапроса =
	// Формирование потребности
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Ссылка.Склад             КАК Склад,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	#Удаление
	|	&Назначение 						   КАК Назначение,
	#КонецУдаления
	#Вставка
	//++ #Б4636 смарт: Шляпников 14.10.2025 / Заказ на внутреннее потребление. Доработка. Возможность указания Назначения.
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА &Назначение ИНАЧЕ ТаблицаТовары.Назначение КОНЕЦ КАК Назначение,
	//-- #Б4636 смарт: Шляпников 14.10.2025
	#КонецВставки
	|	
	|	ТаблицаТовары.Количество               КАК Потребность,
	|	ТаблицаТовары.Количество               КАК КЗаказу,
	|	0                                      КАК НаличиеПодЗаказ
	|
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И НЕ ТаблицаТовары.Отменено
	|
	|	И ТаблицаТовары.ВариантОбеспечения В(
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Закрытие потребности
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	ТаблицаТовары.Ссылка.Склад             КАК Склад,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	#Удаление
	|	&Назначение                            КАК Назначение,
	#КонецУдаления
	#Вставка
	//++ #Б4636 смарт: Шляпников 14.10.2025 / Заказ на внутреннее потребление. Доработка. Возможность указания Назначения.
	|	ВЫБОР КОГДА ТаблицаТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА &Назначение ИНАЧЕ ТаблицаТовары.Назначение КОНЕЦ КАК Назначение,
	//-- #Б4636 смарт: Шляпников 14.10.2025
	#КонецВставки
	|	ТаблицаТовары.Количество               КАК Потребность,
	|	0                                      КАК КЗаказу,
	|	ТаблицаТовары.Количество               КАК НаличиеПодЗаказ
	|
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И НЕ ТаблицаТовары.Отменено
	|
	|	И ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно)
	|
	|	И &Статус В(
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КВыполнению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.Закрыт))";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаТаблицаТоварыКОтгрузке")
Функция смарт_ТекстЗапросаТаблицаТоварыКОтгрузке(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ТоварыКОтгрузке";

	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаТовары.ДатаОтгрузки             КАК Период,
	|	&Склад				                   КАК Склад,
	|	&Подразделение                         КАК Получатель,
	|	&Ссылка                                КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	ТаблицаТовары.Серия                    КАК Серия,
	|	ТаблицаТовары.Количество               КАК ВРезерве,
	|	0                                      КАК КОтгрузке,
	|	0                                      КАК КОформлению
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Количество <> 0
	|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры  В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|	И &ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|	И НЕ ТаблицаТовары.Отменено
	|	И (ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	|		ИЛИ &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КОбеспечению)
	|			И ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаТовары.ДатаОтгрузки             КАК Период,
	|	&Склад				                   КАК Склад,
	|	&Подразделение                         КАК Получатель,
	|	&Ссылка                                КАК ДокументОтгрузки,
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	#Удаление
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно)
	|			И &ДвиженияПоСкладскимРегистрам 
	|			ТОГДА &Назначение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	#КонецУдаления
	#Вставка
	//++ #Б4636 смарт: Шляпников 14.10.2025 / Заказ на внутреннее потребление. Доработка. Возможность указания Назначения.
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно)
	|			И &ДвиженияПоСкладскимРегистрам 
	|			ТОГДА ВЫБОР КОГДА ТаблицаТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА &Назначение ИНАЧЕ ТаблицаТовары.Назначение КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	КОНЕЦ КАК Назначение,
	//-- #Б4636 смарт: Шляпников 14.10.2025
	#КонецВставки
	|	ТаблицаТовары.Серия                    КАК Серия,
	|	0                                      КАК ВРезерве,
	|	ТаблицаТовары.Количество               КАК КОтгрузке,
	|	ТаблицаТовары.Количество               КАК КОформлению
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Количество <> 0
	|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры  В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|	И &ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|	И &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КВыполнению),
	|			ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.Закрыт))
	|	И НЕ ТаблицаТовары.Отменено
	|
	|	И ТаблицаТовары.ВариантОбеспечения В(
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно))";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаТоварыДокумента")
Функция смарт_ТекстЗапросаТоварыДокумента(Отбор)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка                       КАК ЗаказНаВнутреннееПотребление,
	|	Таблица.Номенклатура                 КАК Номенклатура,
	|	Таблица.Характеристика               КАК Характеристика,
	#Удаление
	|	ВЫБОР КОГДА Таблица.ВариантОбеспечения В(
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно)) ТОГДА
	|				Таблица.Ссылка.Назначение
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		КОНЕЦ                            КАК Назначение,
	#КонецУдаления
	#Вставка
	//++ #Б4636 смарт: Шляпников 14.10.2025 / Заказ на внутреннее потребление. Доработка. Возможность указания Назначения.
	|	ВЫБОР КОГДА Таблица.ВариантОбеспечения В(
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно)) ТОГДА
	|				ВЫБОР КОГДА Таблица.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) ТОГДА Таблица.Ссылка.Назначение ИНАЧЕ Таблица.Назначение КОНЕЦ
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		КОНЕЦ                            КАК Назначение,
	//-- #Б4636 смарт: Шляпников 14.10.2025
	#КонецВставки
	|	Таблица.КодСтроки                    КАК КодСтроки,
	|	Таблица.Серия                        КАК Серия,
	|	Таблица.Количество                   КАК Количество,
	|	Таблица.Упаковка                     КАК Упаковка,
	|	Таблица.ДатаОтгрузки                 КАК ДатаОтгрузки,
	|	Таблица.СтатьяРасходов               КАК СтатьяРасходов,
	|	Таблица.АналитикаРасходов            КАК АналитикаРасходов,
	|	Таблица.ГруппаПродукции              КАК ГруппаПродукции,
	|	Таблица.Ссылка.Склад                 КАК Склад,
	|	ЕСТЬNULL(ДанныеУчета.КОформлению, 0) КАК КОформлению,
	|	ЕСТЬNULL(ДанныеУчета.Заказано, 0)    КАК Заказано,
	|	&ЗаказНаВнутреннееПотребление_ТоварыЛокализация
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК Таблица
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтДанныеУчета КАК ДанныеУчета
	|	ПО Таблица.Ссылка = ДанныеУчета.ЗаказНаВнутреннееПотребление
	|	И Таблица.КодСтроки = ДанныеУчета.КодСтроки
	|ГДЕ
	|	НЕ ДанныеУчета.ЗаказНаВнутреннееПотребление ЕСТЬ NULL
	|//&Отбор";

	Если ЗначениеЗаполнено(Отбор) Тогда

		ТекстОтбора = "";

		Для Каждого КлючЗначение Из Отбор Цикл

			Ключ = КлючЗначение.Ключ;

			Если Ключ = "Склад" Тогда
				Ключ = "Таблица.Ссылка.Склад";
			КонецЕсли;

			ТекстОтбора = 
			ТекстОтбора
			+ " И "
			+ Ключ
			+ " В(&"
			+ КлючЗначение.Значение
			+ ")";

		КонецЦикла;

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//&Отбор", ТекстОтбора);

	КонецЕсли;

	ЗаказНаВнутреннееПотреблениеЛокализация.ДобавитьВТекстЗапросаРеквизитыТаблицыТовары(ТекстЗапроса, "Таблица");

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область ДоработкиСмарт
//++ #1263 смарт: Фролов 06.12.2022 //Служебная записка на списание ПФ (Заказ на внутреннее потребление)  
Функция смартПечатьСлужебнойЗаписки(МассивОбъектов, ОбъектыПечати)
Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеЗаказа.Серия КАК СерийныйНомер,
	|	ДанныеЗаказа.Ссылка.Контрагент КАК Клиент,
	|	ЗаказНаВнутреннееПотребление.Склад КАК Склад,
	|	ДанныеЗаказа.Оборудование КАК Оборудование,
	|	ЗаказНаВнутреннееПотребление.Ссылка КАК Ссылка,
	|	ЗаказНаВнутреннееПотребление.Дата КАК Дата,
	|	ЗаказНаВнутреннееПотребление.Ответственный.ФизическоеЛицо.смартДолжность КАК Должность,
	|	ЗаказНаВнутреннееПотребление.Ответственный.ФизическоеЛицо.Наименование КАК Ответственный
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			смартЗаявкаНаРемонтныеРаботыОборудование.Ссылка КАК Ссылка,
	|			смартЗаявкаНаРемонтныеРаботыОборудование.Серия КАК Серия,
	|			смартЗаявкаНаРемонтныеРаботыОборудование.ОборудованиеКлиентов КАК Оборудование
	|		ИЗ
	|			Документ.смартЗаявкаНаРемонтныеРаботы.Оборудование КАК смартЗаявкаНаРемонтныеРаботыОборудование) КАК ДанныеЗаказа
	|		ПО ЗаказНаВнутреннееПотребление.ДокументОснование = ДанныеЗаказа.Ссылка
	|ГДЕ
	|	ЗаказНаВнутреннееПотребление.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаВнутреннееПотреблениеТовары.Ссылка КАК Заказ,
	|	ЗаказНаВнутреннееПотреблениеТовары.Номенклатура.Артикул КАК Артикул,
	|	ЗаказНаВнутреннееПотреблениеТовары.Номенклатура.Наименование КАК Наименование,
	|	ЗаказНаВнутреннееПотреблениеТовары.Количество КАК Количество,
	|	ЗаказНаВнутреннееПотреблениеТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК ЗаказНаВнутреннееПотреблениеТовары
	|ГДЕ
	|	ЗаказНаВнутреннееПотреблениеТовары.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	МасРез=Запрос.ВыполнитьПакет();
	ВыборкаДокументы = МасРез[0].Выбрать();
	РезультатПоСтрокам = МасРез[1].Выгрузить();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказНаВнутреннееПотребление.смартСлужебнаяЗаписка");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_смарт_СлужебнаяЗаписка";
	Пока ВыборкаДокументы.Следующий() Цикл
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры, ВыборкаДокументы);
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		ТабДокумент.Вывести(ОбластьЗаголовок);	
		ТабДокумент.Вывести(ОбластьШапка); 
		СтрокиРезультатПоСтрокам=РезультатПоСтрокам.НайтиСтроки(Новый Структура("Заказ",ВыборкаДокументы.Ссылка));
		Для Каждого СтрРезультатПоСтрокам Из СтрокиРезультатПоСтрокам Цикл
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрРезультатПоСтрокам); 
			ТабДокумент.Вывести(ОбластьСтрока); 
		КонецЦикла;
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.ФИО=ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаДокументы.Ответственный, ВыборкаДокументы.Дата); 
		ОбластьПодвал.Параметры.Дата=Формат(ВыборкаДокументы.Дата,"ДФ=dd.MM.yyyy");
		ОбластьПодвал.Параметры.Должность=ВыборкаДокументы.Должность;
		ТабДокумент.Вывести(ОбластьПодвал);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент,НомерСтрокиНачало, ОбъектыПечати,ВыборкаДокументы.Ссылка);
	КонецЦикла;	
	Возврат ТабДокумент;
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//++ #3918 смарт: Тимофеева 21.08.2025 / Создать ПФ Служебной записки на списание Каталогов 
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "смартСлужебнаяЗаписка") Тогда

	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "смартСлужебнаяЗаписка",
	//			НСтр("ru = 'Служебная записка'"),
	//			смартПечатьСлужебнойЗаписки(МассивОбъектов, ОбъектыПечати));

	//КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "смартСлужебнаяЗапискаНаРемонтныеРаботы") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "смартСлужебнаяЗапискаНаРемонтныеРаботы",
				НСтр("ru = 'Служебная записка на ремонтные работы'"),
				смартПечатьСлужебнойЗаписки(МассивОбъектов, ОбъектыПечати));

			КонецЕсли;
			
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "смартСлужебнаяЗапискаНаСписаниеКаталогов") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "смартСлужебнаяЗапискаНаСписаниеКаталогов",
				НСтр("ru = 'Служебная записка на списание каталогов'"),
				смартПечатьСлужебнойЗапискиНаСписаниеКаталогов(МассивОбъектов, ОбъектыПечати));

	КонецЕсли;
	//-- #3918 смарт: Тимофеева 21.08.2025

КонецПроцедуры 
//-- #1263 смарт: Фролов 06.12.2022

//++ #3918 смарт: Тимофеева 21.08.2025 / Создать ПФ Служебной записки на списание Каталогов
Функция смартПечатьСлужебнойЗапискиНаСписаниеКаталогов(МассивОбъектов, ОбъектыПечати)
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_смарт_ПФ_MXL_СлужебнаяЗапискаНаСписаниеКаталогов";

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаказНаВнутреннееПотребление.Ссылка КАК Ссылка,
	|	ЗаказНаВнутреннееПотребление.Организация КАК Организация,
	|	ЗаказНаВнутреннееПотребление.Организация.НаименованиеСокращенное КАК НаименованиеОрганизации,
	|	ЗаказНаВнутреннееПотребление.Склад КАК Склад,
	|	ЗаказНаВнутреннееПотребление.Дата КАК Дата,
	|	ЕСТЬNULL(Пользователи.ФизическоеЛицо.Наименование, """") КАК Ответственный,
	|	ЕСТЬNULL(Пользователи.ФизическоеЛицо.смартДолжность, """") КАК Должность
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ЗаказНаВнутреннееПотребление.Ответственный = Пользователи.Ссылка
	|ГДЕ
	|	ЗаказНаВнутреннееПотребление.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаВнутреннееПотреблениеТовары.Ссылка КАК Заказ,
	|	ЗаказНаВнутреннееПотреблениеТовары.Номенклатура.Артикул КАК Артикул,
	|	ЗаказНаВнутреннееПотреблениеТовары.Номенклатура.Наименование КАК Наименование,
	|	ЗаказНаВнутреннееПотреблениеТовары.Количество КАК Количество,
	|	ЗаказНаВнутреннееПотреблениеТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК ЗаказНаВнутреннееПотреблениеТовары
	|ГДЕ
	|	ЗаказНаВнутреннееПотреблениеТовары.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДокументы = РезультатЗапроса[0].Выбрать();
	ТаблицаТовары 	 = РезультатЗапроса[1].Выгрузить();
	Макет 			 = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказНаВнутреннееПотребление.ПФ_MXL_СлужебнаяЗапискаНаСписаниеКаталогов");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка 	 = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока 	 = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал 	 = Макет.ПолучитьОбласть("Подвал");
	
	ПервыйДокумент 	 = Истина;
	Пока ВыборкаДокументы.Следующий() Цикл
		Если ПервыйДокумент Тогда
			ПервыйДокумент = Ложь;
		Иначе
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НачалоТекущегоФрагмента = ТабДокумент.ВысотаТаблицы + 1;
		
		ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры, ВыборкаДокументы);
		ОтветственныеЛица 	  	= ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(ВыборкаДокументы.Организация); 
		ДолжностьРуководителя 	= ОтветственныеЛица.РуководительДолжность;
		Д_ДолжностьРуководителя = ПолучитьСклоненияСтроки(ДолжностьРуководителя, "ПЛ=Мужской", "ПД=Дательный");
		ФИОРуководителя	  	  	= ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ОтветственныеЛица.Руководитель);
		Д_ФИОРуководителя     	= ПолучитьСклоненияСтроки(ФИОРуководителя, 
                            	?(ОтветственныеЛица.Руководитель.Пол = Перечисления.ПолФизическогоЛица.Женский, "ПЛ=Женский", "ПЛ=Мужской"), 
								"ПД=Дательный");
		ОбластьЗаголовок.Параметры.ДолжностьРуководителя = ?(Д_ДолжностьРуководителя.Количество() > 0, Д_ДолжностьРуководителя[0], 
																										"Генеральному директору");
		ОбластьЗаголовок.Параметры.ФИОРуководителя 		 = ?(Д_ФИОРуководителя.Количество() > 0, Д_ФИОРуководителя[0], "");
	    ТабДокумент.Вывести(ОбластьЗаголовок);	
		ТабДокумент.Вывести(ОбластьШапка); 
		
		ТаблицаТоварыЗаказа = ТаблицаТовары.НайтиСтроки(Новый Структура("Заказ", ВыборкаДокументы.Ссылка));
		Для Каждого СтрокаТаблицыТовары Из ТаблицаТоварыЗаказа Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаТаблицыТовары); 
			ТабДокумент.Вывести(ОбластьСтрока); 
		КонецЦикла; 
		
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ВыборкаДокументы);
		ОбластьПодвал.Параметры.ФИО = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаДокументы.Ответственный, ВыборкаДокументы.Дата); 
		
		ТабДокумент.Вывести(ОбластьПодвал);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НачалоТекущегоФрагмента, ОбъектыПечати, ВыборкаДокументы.Ссылка);
	КонецЦикла;	
	Возврат ТабДокумент;
КонецФункции 
//-- #3918 смарт: Тимофеева 21.08.2025

#КонецОбласти

#КонецЕсли
